# Х шоколадных конфет стоят А рублей
# Y ирисок стоит В рублей
# Определить сколько стоит 1 кг шоколадных конфет, 1 кг ирисок, а также во сколько раз шоколадные конфеты дороже ирисок

X = float(input("Введите вес шоколадных конфет (кг): "))
A = float(input("Введите стоимость шоколадных конфет (руб): "))
Y = float(input("Введите вес ирисок (кг): "))
B = float(input("Введите стоимость ирисок (руб): "))

price_chocolate = A/X
price_iris = B/Y

times = price_chocolate / price_iris

print("Цена шоколадных конфет: ", price_chocolate)
print("Цена ирисок: ", price_iris)
print(f"Шоколадные конфеты в {times} раза дороже ирисок")