# При открытии вклада в банке установлены следующие годовые проценты:
# - при вкладе до 50000р. процент составит 4%;
# - при вкладе от 50000р. до 100000р. процент составит 5%;
# - при вкладе от 100000р. до 150000р. процент составит 6%;
# - при вкладе от 150000р. до 200000р. процент составит 7%.
#
# Составить программу, определяющую процентную ставку
# в зависимости от вносимой суммы.

deposit = input("Введите сумму вклада: ")

while type(deposit) != int: # обработка исключений
    try:
        deposit = int(deposit)
    except ValueError:
        print("Неправильно ввели!")
        deposit = input("Введите сумму вклада: ")

if deposit < 0:
    print("Ошибка: сумма вклада не может быть отрицательной")
else:
    if deposit < 50000:
       interest_rate = 4
    elif deposit < 100000:
        interest_rate = 5
    elif deposit < 150000:
        interest_rate = 6
    else:
        interest_rate = 7
    print(f"Ваша процентная ставка: {interest_rate}%")

